{
	"education" : 	[
		{
			"institution" : "The University of Melbourne",
			"title" : "BSc (Computing and Software Systems)",
			"date" : 2014,
			"subjects" : ["IT Project", "Graphics and Interaction", "Informatics (1, 2, and 3)", "Software Modeling and Design", "Computer Systems", "Declarative Programming"],
			"description" : "<p>My degree involved a good mixture of subjects from both Computer Science and Software Engineering disciplines.</p><p>Project work, especially when programming using unfamiliar concepts, was the most enjoyable part of my degree. For example, in my final semester I had to concurrently manage two teams creating a mobile app and a 3D game in DirectX, two areas I had zero previous experience in. To go from knowing very little about the technologies to making functional applications in a matter of weeks was very rewarding, and the team-based project work greatly improved my skills in developing applications with others, especially in a high pressure situation with looming deadlines.</p><p>One other key area I greatly improved is in my ability to work, and learn, autonomously by myself. I would often take the topics, languages, and concepts touched on in classes and explore them on my own, teaching myself the programming languages along the way. In fact, very little of my actual programming ability was actually learned at university, as I prefer to learn-by-doing whilst teaching myself, rather than the usual approach of, \"Learn, then do.\"</p><p>Despite my excellent scores in project work, I was often let down by my exam marks, which resulted in lower scores than I expected. Nonetheless, I have focused my efforts on improving my practical skills in both web development and programming in general, and the breadth of my project work is an indicator of that.</p>"
		},
		{
			"institution" : "Brighton Grammar School",
			"title" : "VCE",
			"date" : 2010,
			"subjects" : ["Mathematical Methods", "Biology", "Japanese", "Business Management", "English"],
			"description" : "<p>During my time at school I was a member of the concert band percussion section, achieved a Silver level in the Duke of Edinburgh award, and was a part of the army cadet program.</p><p>I was also chosen to participate in the gifted learning program.</p><p>In 2009 I was part of a small group that embarked on a two-week exchange to Japan. This trip allowed me to expand my skills in Japanese, but also to soak up the Japanese culture as well. I stayed with a Japanese family and attended school in Tokyo, before travelling to Kyoto and Hiroshima.</p>"
		}
	],
	"jobs" : 		[
		{
			"company" : "Untapped Fine Wines",
			"title" : "IT Manager",
			"format" : "Full/Part-time",
			"date" : "2011-Present",
			"responsibilities" : ["Web developer", "Responsible for the entire company's IT infrastructure", "Maintaining a fleet of computers and mobile devices", "Developing and deploying programs to assist business processes", "Regular creation of marketing materials (EDMs)", "Product photographer", "Graphic designer"],
			"description" : "<p>I was present when the company began in 2011, and since then the business has grown from just a few employees to a team of over twenty people, including those interstate in NSW, QLD, and WA, and overseas at our South American office. As the company has grown, so has its IT requirements, and it has been my responsibility to manage the company's entire IT infrastructure.</p><p>Each employee has a laptop and phone that I have to oversee and manage, in addition to maintaining the company's email system and web hosting servers (offsite).</p><p>I built the company's website, hosted on the BigCommerce ecommerce platform, and have recently been responsible for moving platforms to Magento, based on a VPS hosting server. In developing the initial site, I was responsible for the entire process, including planning the initial design, styling using HTML and CSS, adding functional components using Javascript and JQuery, and importing all the original data (including photographing products).</p><p>Outside of web development, I am involved in the management and marketing of the business, working closely with other managers to set promotions, design EDMs, and improve conversion rates. I also develop web-apps and other programs to streamline internal business processes.</p><p>I worked part-time during university, and full-time during holiday periods.</p>"
		},
		{
			"company" : "Ansett Aviation Training",
			"title" : "Administrative Assistant",
			"format" : "Part-time",
			"date" : "2008-2010",
			"responsibilities" : ["Setting up of computers, installing software and operating systems", "Organisation of conference room technology", "Database work using Microsoft Access",	"Website work including instructional videos and enhancements",	"Customer liaison",	"Reception work"],
			"description" : "<p>In this job I served a multitude of roles, which included everything from data-entry to maintenance of the premises.</p><p>I was responsible for painting a large portion of the building interior, clearing out storage rooms, and setting up computer systems and software for employee use.</p><p>I also worked in the kitchen, serving coffee and refreshments to customers, and in the reception as an administrative assistant.</p>"
		}
	],
	"dev" : 		[
		
	],
	"other" : 		[
		
	]
}